Tekla.Structures.PluginsInternal.Remoter
Remoter class for plugins

Tekla.Structures.PluginsInternal.Remoter.ChannelName
The channel name

Tekla.Structures.PluginsInternal.Remoter.InitializeSandBox
Initializes the sand box.
Returns: bool is initialezed

Tekla.Structures.PluginsInternal.Remoter.GetConnectionStatus
Initializes the connection to TS. Must be called before the first operation.
Returns: returns connection status

Tekla.Structures.PluginsInternal.Remoter.DisposeService
Dispose Remoting services

Tekla.Structures.PluginsInternal.Remoter.Dispose
